MikroElektronika/core_packages/PIC/XC8/def/PIC10LF320/mcu.h
// Register: IOCAF
#define IOCAF IOCAF
extern volatile unsigned char           IOCAF               __at(0x01C);
#ifndef _LIB_BUILD
asm("IOCAF equ 01Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCAF0                 :1;
        unsigned IOCAF1                 :1;
        unsigned IOCAF2                 :1;
        unsigned IOCAF3                 :1;
    };
} IOCAFbits_t;
extern volatile IOCAFbits_t IOCAFbits __at(0x01C);
// bitfield macros
#define _IOCAF_IOCAF0_POSN                                  0x0
#define _IOCAF_IOCAF0_POSITION                              0x0
#define _IOCAF_IOCAF0_SIZE                                  0x1
#define _IOCAF_IOCAF0_LENGTH                                0x1
#define _IOCAF_IOCAF0_MASK                                  0x1
#define _IOCAF_IOCAF1_POSN                                  0x1
#define _IOCAF_IOCAF1_POSITION                              0x1
#define _IOCAF_IOCAF1_SIZE                                  0x1
#define _IOCAF_IOCAF1_LENGTH                                0x1
#define _IOCAF_IOCAF1_MASK                                  0x2
#define _IOCAF_IOCAF2_POSN                                  0x2
#define _IOCAF_IOCAF2_POSITION                              0x2
#define _IOCAF_IOCAF2_SIZE                                  0x1
#define _IOCAF_IOCAF2_LENGTH                                0x1
#define _IOCAF_IOCAF2_MASK                                  0x4
#define _IOCAF_IOCAF3_POSN                                  0x3
#define _IOCAF_IOCAF3_POSITION                              0x3
#define _IOCAF_IOCAF3_SIZE                                  0x1
#define _IOCAF_IOCAF3_LENGTH                                0x1
#define _IOCAF_IOCAF3_MASK                                  0x8

// Register: FVRCON
#define FVRCON FVRCON
extern volatile unsigned char           FVRCON              __at(0x01D);
#ifndef _LIB_BUILD
asm("FVRCON equ 01Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADFVR                  :2;
        unsigned                        :2;
        unsigned TSRNG                  :1;
        unsigned TSEN                   :1;
        unsigned FVRRDY                 :1;
        unsigned FVREN                  :1;
    };
    struct {
        unsigned ADFVR0                 :1;
        unsigned ADFVR1                 :1;
    };
} FVRCONbits_t;
extern volatile FVRCONbits_t FVRCONbits __at(0x01D);
// bitfield macros
#define _FVRCON_ADFVR_POSN                                  0x0
#define _FVRCON_ADFVR_POSITION                              0x0
#define _FVRCON_ADFVR_SIZE                                  0x2
#define _FVRCON_ADFVR_LENGTH                                0x2
#define _FVRCON_ADFVR_MASK                                  0x3
#define _FVRCON_TSRNG_POSN                                  0x4
#define _FVRCON_TSRNG_POSITION                              0x4
#define _FVRCON_TSRNG_SIZE                                  0x1
#define _FVRCON_TSRNG_LENGTH                                0x1
#define _FVRCON_TSRNG_MASK                                  0x10
#define _FVRCON_TSEN_POSN                                   0x5
#define _FVRCON_TSEN_POSITION                               0x5
#define _FVRCON_TSEN_SIZE                                   0x1
#define _FVRCON_TSEN_LENGTH                                 0x1
#define _FVRCON_TSEN_MASK                                   0x20
#define _FVRCON_FVRRDY_POSN                                 0x6
#define _FVRCON_FVRRDY_POSITION                             0x6
#define _FVRCON_FVRRDY_SIZE                                 0x1
#define _FVRCON_FVRRDY_LENGTH                               0x1
#define _FVRCON_FVRRDY_MASK                                 0x40
#define _FVRCON_FVREN_POSN                                  0x7
#define _FVRCON_FVREN_POSITION                              0x7
#define _FVRCON_FVREN_SIZE                                  0x1
#define _FVRCON_FVREN_LENGTH                                0x1
#define _FVRCON_FVREN_MASK                                  0x80
#define _FVRCON_ADFVR0_POSN                                 0x0
#define _FVRCON_ADFVR0_POSITION                             0x0
#define _FVRCON_ADFVR0_SIZE                                 0x1
#define _FVRCON_ADFVR0_LENGTH                               0x1
#define _FVRCON_ADFVR0_MASK                                 0x1
#define _FVRCON_ADFVR1_POSN                                 0x1
#define _FVRCON_ADFVR1_POSITION                             0x1
#define _FVRCON_ADFVR1_SIZE                                 0x1
#define _FVRCON_ADFVR1_LENGTH                               0x1
#define _FVRCON_ADFVR1_MASK                                 0x2

// Register: ADRES
#define ADRES ADRES
extern volatile unsigned char           ADRES               __at(0x01E);
#ifndef _LIB_BUILD
asm("ADRES equ 01Eh");
#endif

// Register: ADCON
#define ADCON ADCON
extern volatile unsigned char           ADCON               __at(0x01F);
#ifndef _LIB_BUILD
asm("ADCON equ 01Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADON                   :1;
        unsigned GO_nDONE               :1;
        unsigned CHS                    :3;
        unsigned ADCS                   :3;
    };
    struct {
        unsigned                        :2;
        unsigned CHS0                   :1;
        unsigned CHS1                   :1;
        unsigned CHS2                   :1;
        unsigned ADCS0                  :1;
        unsigned ADCS1                  :1;
        unsigned ADCS2                  :1;
    };
} ADCONbits_t;
extern volatile ADCONbits_t ADCONbits __at(0x01F);
// bitfield macros
#define _ADCON_ADON_POSN                                    0x0
#define _ADCON_ADON_POSITION                                0x0
#define _ADCON_ADON_SIZE                                    0x1
#define _ADCON_ADON_LENGTH                                  0x1
#define _ADCON_ADON_MASK                                    0x1
#define _ADCON_GO_nDONE_POSN                                0x1
#define _ADCON_GO_nDONE_POSITION                            0x1
#define _ADCON_GO_nDONE_SIZE                                0x1
#define _ADCON_GO_nDONE_LENGTH                              0x1
#define _ADCON_GO_nDONE_MASK                                0x2
#define _ADCON_CHS_POSN                                     0x2
#define _ADCON_CHS_POSITION                                 0x2
#define _ADCON_CHS_SIZE                                     0x3
#define _ADCON_CHS_LENGTH                                   0x3
#define _ADCON_CHS_MASK                                     0x1C
#define _ADCON_ADCS_POSN                                    0x5
#define _ADCON_ADCS_POSITION                                0x5
#define _ADCON_ADCS_SIZE                                    0x3
#define _ADCON_ADCS_LENGTH                                  0x3
#define _ADCON_ADCS_MASK                                    0xE0
#define _ADCON_CHS0_POSN                                    0x2
#define _ADCON_CHS0_POSITION                                0x2
#define _ADCON_CHS0_SIZE                                    0x1
#define _ADCON_CHS0_LENGTH                                  0x1
#define _ADCON_CHS0_MASK                                    0x4
#define _ADCON_CHS1_POSN                                    0x3
#define _ADCON_CHS1_POSITION                                0x3
#define _ADCON_CHS1_SIZE                                    0x1
#define _ADCON_CHS1_LENGTH                                  0x1
#define _ADCON_CHS1_MASK                                    0x8
#define _ADCON_CHS2_POSN                                    0x4
#define _ADCON_CHS2_POSITION                                0x4
#define _ADCON_CHS2_SIZE                                    0x1
#define _ADCON_CHS2_LENGTH                                  0x1
#define _ADCON_CHS2_MASK                                    0x10
#define _ADCON_ADCS0_POSN                                   0x5
#define _ADCON_ADCS0_POSITION                               0x5
#define _ADCON_ADCS0_SIZE                                   0x1
#define _ADCON_ADCS0_LENGTH                                 0x1
#define _ADCON_ADCS0_MASK                                   0x20
#define _ADCON_ADCS1_POSN                                   0x6
#define _ADCON_ADCS1_POSITION                               0x6
#define _ADCON_ADCS1_SIZE                                   0x1
#define _ADCON_ADCS1_LENGTH                                 0x1
#define _ADCON_ADCS1_MASK                                   0x40
#define _ADCON_ADCS2_POSN                                   0x7
#define _ADCON_ADCS2_POSITION                               0x7
#define _ADCON_ADCS2_SIZE                                   0x1
#define _ADCON_ADCS2_LENGTH                                 0x1
#define _ADCON_ADCS2_MASK                                   0x80

// Register: PMADR
#define PMADR PMADR
extern volatile unsigned short          PMADR               __at(0x020);
#ifndef _LIB_BUILD
asm("PMADR equ 020h");
#endif

// Register: PMADRL
#define PMADRL PMADRL
extern volatile unsigned char           PMADRL              __at(0x020);
#ifndef _LIB_BUILD
asm("PMADRL equ 020h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMADR                  :8;
    };
} PMADRLbits_t;
extern volatile PMADRLbits_t PMADRLbits __at(0x020);
// bitfield macros
#define _PMADRL_PMADR_POSN                                  0x0
#define _PMADRL_PMADR_POSITION                              0x0
#define _PMADRL_PMADR_SIZE                                  0x8
#define _PMADRL_PMADR_LENGTH                                0x8
#define _PMADRL_PMADR_MASK                                  0xFF

// Register: PMADRH
#define PMADRH PMADRH
extern volatile unsigned char           PMADRH              __at(0x021);
#ifndef _LIB_BUILD
asm("PMADRH equ 021h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PMADR8                 :1;
    };
} PMADRHbits_t;
