MikroElektronika/core_packages/PIC/XC8/def/PIC10LF320/mcu.h
extern volatile BORCONbits_t BORCONbits __at(0x03F);
// bitfield macros
#define _BORCON_BORRDY_POSN                                 0x0
#define _BORCON_BORRDY_POSITION                             0x0
#define _BORCON_BORRDY_SIZE                                 0x1
#define _BORCON_BORRDY_LENGTH                               0x1
#define _BORCON_BORRDY_MASK                                 0x1
#define _BORCON_BORFS_POSN                                  0x6
#define _BORCON_BORFS_POSITION                              0x6
#define _BORCON_BORFS_SIZE                                  0x1
#define _BORCON_BORFS_LENGTH                                0x1
#define _BORCON_BORFS_MASK                                  0x40
#define _BORCON_SBOREN_POSN                                 0x7
#define _BORCON_SBOREN_POSITION                             0x7
#define _BORCON_SBOREN_SIZE                                 0x1
#define _BORCON_SBOREN_LENGTH                               0x1
#define _BORCON_SBOREN_MASK                                 0x80

/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON<ADCS0>
extern volatile __bit                   ADCS0               __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON,5)
// ADCON<ADCS1>
extern volatile __bit                   ADCS1               __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON,6)
// ADCON<ADCS2>
extern volatile __bit                   ADCS2               __at(0xFF);	// @ (0x1F * 8 + 7)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON,7)
// FVRCON<ADFVR0>
extern volatile __bit                   ADFVR0              __at(0xE8);	// @ (0x1D * 8 + 0)
#define                                 ADFVR0_bit          _BIT_ACCESS(FVRCON,0)
// FVRCON<ADFVR1>
extern volatile __bit                   ADFVR1              __at(0xE9);	// @ (0x1D * 8 + 1)
#define                                 ADFVR1_bit          _BIT_ACCESS(FVRCON,1)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x6E);	// @ (0xD * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON<ADON>
extern volatile __bit                   ADON                __at(0xF8);	// @ (0x1F * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON,0)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0x40);	// @ (0x8 * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0x41);	// @ (0x8 * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0x42);	// @ (0x8 * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// BORCON<BORFS>
extern volatile __bit                   BORFS               __at(0x1FE);	// @ (0x3F * 8 + 6)
#define                                 BORFS_bit           _BIT_ACCESS(BORCON,6)
// BORCON<BORRDY>
extern volatile __bit                   BORRDY              __at(0x1F8);	// @ (0x3F * 8 + 0)
#define                                 BORRDY_bit          _BIT_ACCESS(BORCON,0)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PMCON1<CFGS>
extern volatile __bit                   CFGS                __at(0x126);	// @ (0x24 * 8 + 6)
#define                                 CFGS_bit            _BIT_ACCESS(PMCON1,6)
// ADCON<CHS0>
extern volatile __bit                   CHS0                __at(0xFA);	// @ (0x1F * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON,2)
// ADCON<CHS1>
extern volatile __bit                   CHS1                __at(0xFB);	// @ (0x1F * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON,3)
// ADCON<CHS2>
extern volatile __bit                   CHS2                __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON,4)
// PIE1<CLC1IE>
extern volatile __bit                   CLC1IE              __at(0x6B);	// @ (0xD * 8 + 3)
#define                                 CLC1IE_bit          _BIT_ACCESS(PIE1,3)
// PIR1<CLC1IF>
extern volatile __bit                   CLC1IF              __at(0x63);	// @ (0xC * 8 + 3)
#define                                 CLC1IF_bit          _BIT_ACCESS(PIR1,3)
// CLKRCON<CLKROE>
extern volatile __bit                   CLKROE              __at(0x136);	// @ (0x26 * 8 + 6)
#define                                 CLKROE_bit          _BIT_ACCESS(CLKRCON,6)
// CWG1DBF<CWG1DBF0>
extern volatile __bit                   CWG1DBF0            __at(0x1E8);	// @ (0x3D * 8 + 0)
#define                                 CWG1DBF0_bit        _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<CWG1DBF1>
extern volatile __bit                   CWG1DBF1            __at(0x1E9);	// @ (0x3D * 8 + 1)
#define                                 CWG1DBF1_bit        _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<CWG1DBF2>
extern volatile __bit                   CWG1DBF2            __at(0x1EA);	// @ (0x3D * 8 + 2)
#define                                 CWG1DBF2_bit        _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<CWG1DBF3>
extern volatile __bit                   CWG1DBF3            __at(0x1EB);	// @ (0x3D * 8 + 3)
#define                                 CWG1DBF3_bit        _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<CWG1DBF4>
extern volatile __bit                   CWG1DBF4            __at(0x1EC);	// @ (0x3D * 8 + 4)
#define                                 CWG1DBF4_bit        _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<CWG1DBF5>
extern volatile __bit                   CWG1DBF5            __at(0x1ED);	// @ (0x3D * 8 + 5)
#define                                 CWG1DBF5_bit        _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<CWG1DBR0>
extern volatile __bit                   CWG1DBR0            __at(0x1E0);	// @ (0x3C * 8 + 0)
#define                                 CWG1DBR0_bit        _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<CWG1DBR1>
extern volatile __bit                   CWG1DBR1            __at(0x1E1);	// @ (0x3C * 8 + 1)
#define                                 CWG1DBR1_bit        _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<CWG1DBR2>
extern volatile __bit                   CWG1DBR2            __at(0x1E2);	// @ (0x3C * 8 + 2)
#define                                 CWG1DBR2_bit        _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<CWG1DBR3>
extern volatile __bit                   CWG1DBR3            __at(0x1E3);	// @ (0x3C * 8 + 3)
#define                                 CWG1DBR3_bit        _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<CWG1DBR4>
extern volatile __bit                   CWG1DBR4            __at(0x1E4);	// @ (0x3C * 8 + 4)
#define                                 CWG1DBR4_bit        _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<CWG1DBR5>
extern volatile __bit                   CWG1DBR5            __at(0x1E5);	// @ (0x3C * 8 + 5)
#define                                 CWG1DBR5_bit        _BIT_ACCESS(CWG1DBR,5)
// CLC1SEL0<D1S0>
extern volatile __bit                   D1S0                __at(0x190);	// @ (0x32 * 8 + 0)
#define                                 D1S0_bit            _BIT_ACCESS(CLC1SEL0,0)
// CLC1SEL0<D1S1>
extern volatile __bit                   D1S1                __at(0x191);	// @ (0x32 * 8 + 1)
#define                                 D1S1_bit            _BIT_ACCESS(CLC1SEL0,1)
// CLC1SEL0<D1S2>
extern volatile __bit                   D1S2                __at(0x192);	// @ (0x32 * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLC1SEL0,2)
// CLC1SEL0<D2S0>
extern volatile __bit                   D2S0                __at(0x194);	// @ (0x32 * 8 + 4)
#define                                 D2S0_bit            _BIT_ACCESS(CLC1SEL0,4)
// CLC1SEL0<D2S1>
extern volatile __bit                   D2S1                __at(0x195);	// @ (0x32 * 8 + 5)
#define                                 D2S1_bit            _BIT_ACCESS(CLC1SEL0,5)
// CLC1SEL0<D2S2>
extern volatile __bit                   D2S2                __at(0x196);	// @ (0x32 * 8 + 6)
#define                                 D2S2_bit            _BIT_ACCESS(CLC1SEL0,6)
// CLC1SEL1<D3S0>
extern volatile __bit                   D3S0                __at(0x198);	// @ (0x33 * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLC1SEL1,0)
// CLC1SEL1<D3S1>
extern volatile __bit                   D3S1                __at(0x199);	// @ (0x33 * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLC1SEL1,1)
// CLC1SEL1<D3S2>
extern volatile __bit                   D3S2                __at(0x19A);	// @ (0x33 * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLC1SEL1,2)
// CLC1SEL1<D4S0>
extern volatile __bit                   D4S0                __at(0x19C);	// @ (0x33 * 8 + 4)
#define                                 D4S0_bit            _BIT_ACCESS(CLC1SEL1,4)
// CLC1SEL1<D4S1>
extern volatile __bit                   D4S1                __at(0x19D);	// @ (0x33 * 8 + 5)
#define                                 D4S1_bit            _BIT_ACCESS(CLC1SEL1,5)
// CLC1SEL1<D4S2>
extern volatile __bit                   D4S2                __at(0x19E);	// @ (0x33 * 8 + 6)
#define                                 D4S2_bit            _BIT_ACCESS(CLC1SEL1,6)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// PMCON1<FREE>
extern volatile __bit                   FREE                __at(0x124);	// @ (0x24 * 8 + 4)
#define                                 FREE_bit            _BIT_ACCESS(PMCON1,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0xEF);	// @ (0x1D * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0xEE);	// @ (0x1D * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// CWG1CON2<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0x1DE);	// @ (0x3B * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(CWG1CON2,6)
// CWG1CON2<G1ASDCLC1>
extern volatile __bit                   G1ASDCLC1           __at(0x1D9);	// @ (0x3B * 8 + 1)
#define                                 G1ASDCLC1_bit       _BIT_ACCESS(CWG1CON2,1)
// CWG1CON2<G1ASDFLT>
extern volatile __bit                   G1ASDFLT            __at(0x1D8);	// @ (0x3B * 8 + 0)
#define                                 G1ASDFLT_bit        _BIT_ACCESS(CWG1CON2,0)
// CWG1CON1<G1ASDLA0>
extern volatile __bit                   G1ASDLA0            __at(0x1D4);	// @ (0x3A * 8 + 4)
#define                                 G1ASDLA0_bit        _BIT_ACCESS(CWG1CON1,4)
// CWG1CON1<G1ASDLA1>
extern volatile __bit                   G1ASDLA1            __at(0x1D5);	// @ (0x3A * 8 + 5)
#define                                 G1ASDLA1_bit        _BIT_ACCESS(CWG1CON1,5)
// CWG1CON1<G1ASDLB0>
extern volatile __bit                   G1ASDLB0            __at(0x1D6);	// @ (0x3A * 8 + 6)
#define                                 G1ASDLB0_bit        _BIT_ACCESS(CWG1CON1,6)
// CWG1CON1<G1ASDLB1>
extern volatile __bit                   G1ASDLB1            __at(0x1D7);	// @ (0x3A * 8 + 7)
#define                                 G1ASDLB1_bit        _BIT_ACCESS(CWG1CON1,7)
// CWG1CON2<G1ASDSCLC1>
extern volatile __bit                   G1ASDSCLC1          __at(0x1D9);	// @ (0x3B * 8 + 1)
#define                                 G1ASDSCLC1_bit      _BIT_ACCESS(CWG1CON2,1)
// CWG1CON2<G1ASDSFLT>
extern volatile __bit                   G1ASDSFLT           __at(0x1D8);	// @ (0x3B * 8 + 0)
#define                                 G1ASDSFLT_bit       _BIT_ACCESS(CWG1CON2,0)
// CWG1CON2<G1ASE>
extern volatile __bit                   G1ASE               __at(0x1DF);	// @ (0x3B * 8 + 7)
#define                                 G1ASE_bit           _BIT_ACCESS(CWG1CON2,7)
// CWG1CON0<G1CS0>
extern volatile __bit                   G1CS0               __at(0x1C8);	// @ (0x39 * 8 + 0)
#define                                 G1CS0_bit           _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0x1CF);	// @ (0x39 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(CWG1CON0,7)
// CWG1CON1<G1IS0>
extern volatile __bit                   G1IS0               __at(0x1D0);	// @ (0x3A * 8 + 0)
#define                                 G1IS0_bit           _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<G1IS1>
extern volatile __bit                   G1IS1               __at(0x1D1);	// @ (0x3A * 8 + 1)
#define                                 G1IS1_bit           _BIT_ACCESS(CWG1CON1,1)
// CWG1CON0<G1OEA>
extern volatile __bit                   G1OEA               __at(0x1CD);	// @ (0x39 * 8 + 5)
#define                                 G1OEA_bit           _BIT_ACCESS(CWG1CON0,5)
// CWG1CON0<G1OEB>
extern volatile __bit                   G1OEB               __at(0x1CE);	// @ (0x39 * 8 + 6)
#define                                 G1OEB_bit           _BIT_ACCESS(CWG1CON0,6)
// CLC1POL<G1POL>
extern volatile __bit                   G1POL               __at(0x1A0);	// @ (0x34 * 8 + 0)
#define                                 G1POL_bit           _BIT_ACCESS(CLC1POL,0)
// CWG1CON0<G1POLA>
extern volatile __bit                   G1POLA              __at(0x1CB);	// @ (0x39 * 8 + 3)
#define                                 G1POLA_bit          _BIT_ACCESS(CWG1CON0,3)
// CWG1CON0<G1POLB>
extern volatile __bit                   G1POLB              __at(0x1CC);	// @ (0x39 * 8 + 4)
#define                                 G1POLB_bit          _BIT_ACCESS(CWG1CON0,4)
// CLC1POL<G2POL>
extern volatile __bit                   G2POL               __at(0x1A1);	// @ (0x34 * 8 + 1)
#define                                 G2POL_bit           _BIT_ACCESS(CLC1POL,1)
// CLC1POL<G3POL>
extern volatile __bit                   G3POL               __at(0x1A2);	// @ (0x34 * 8 + 2)
#define                                 G3POL_bit           _BIT_ACCESS(CLC1POL,2)
// CLC1GLS3<G4D1N>
extern volatile __bit                   G4D1N               __at(0x1C0);	// @ (0x38 * 8 + 0)
#define                                 G4D1N_bit           _BIT_ACCESS(CLC1GLS3,0)
// CLC1GLS3<G4D1T>
extern volatile __bit                   G4D1T               __at(0x1C1);	// @ (0x38 * 8 + 1)
#define                                 G4D1T_bit           _BIT_ACCESS(CLC1GLS3,1)
// CLC1GLS3<G4D2N>
extern volatile __bit                   G4D2N               __at(0x1C2);	// @ (0x38 * 8 + 2)
#define                                 G4D2N_bit           _BIT_ACCESS(CLC1GLS3,2)
// CLC1GLS3<G4D2T>
extern volatile __bit                   G4D2T               __at(0x1C3);	// @ (0x38 * 8 + 3)
#define                                 G4D2T_bit           _BIT_ACCESS(CLC1GLS3,3)
// CLC1GLS3<G4D3N>
extern volatile __bit                   G4D3N               __at(0x1C4);	// @ (0x38 * 8 + 4)
#define                                 G4D3N_bit           _BIT_ACCESS(CLC1GLS3,4)
// CLC1GLS3<G4D3T>
extern volatile __bit                   G4D3T               __at(0x1C5);	// @ (0x38 * 8 + 5)
#define                                 G4D3T_bit           _BIT_ACCESS(CLC1GLS3,5)
// CLC1GLS3<G4D4N>
extern volatile __bit                   G4D4N               __at(0x1C6);	// @ (0x38 * 8 + 6)
#define                                 G4D4N_bit           _BIT_ACCESS(CLC1GLS3,6)
// CLC1GLS3<G4D4T>
extern volatile __bit                   G4D4T               __at(0x1C7);	// @ (0x38 * 8 + 7)
#define                                 G4D4T_bit           _BIT_ACCESS(CLC1GLS3,7)
// CLC1POL<G4POL>
extern volatile __bit                   G4POL               __at(0x1A3);	// @ (0x34 * 8 + 3)
#define                                 G4POL_bit           _BIT_ACCESS(CLC1POL,3)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF9);	// @ (0x1F * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON,1)
// OSCCON<HFIOFR>
extern volatile __bit                   HFIOFR              __at(0x83);	// @ (0x10 * 8 + 3)
#define                                 HFIOFR_bit          _BIT_ACCESS(OSCCON,3)
// OSCCON<HFIOFS>
extern volatile __bit                   HFIOFS              __at(0x80);	// @ (0x10 * 8 + 0)
#define                                 HFIOFS_bit          _BIT_ACCESS(OSCCON,0)
// INTCON<INTE>
extern volatile __bit                   INTE                __at(0x5C);	// @ (0xB * 8 + 4)
#define                                 INTE_bit            _BIT_ACCESS(INTCON,4)
// OPTION_REG<INTEDG>
extern volatile __bit                   INTEDG              __at(0x76);	// @ (0xE * 8 + 6)
#define                                 INTEDG_bit          _BIT_ACCESS(OPTION_REG,6)
// INTCON<INTF>
extern volatile __bit                   INTF                __at(0x59);	// @ (0xB * 8 + 1)
#define                                 INTF_bit            _BIT_ACCESS(INTCON,1)
// IOCAF<IOCAF0>
extern volatile __bit                   IOCAF0              __at(0xE0);	// @ (0x1C * 8 + 0)
#define                                 IOCAF0_bit          _BIT_ACCESS(IOCAF,0)
// IOCAF<IOCAF1>
extern volatile __bit                   IOCAF1              __at(0xE1);	// @ (0x1C * 8 + 1)
#define                                 IOCAF1_bit          _BIT_ACCESS(IOCAF,1)
// IOCAF<IOCAF2>
extern volatile __bit                   IOCAF2              __at(0xE2);	// @ (0x1C * 8 + 2)
#define                                 IOCAF2_bit          _BIT_ACCESS(IOCAF,2)
// IOCAF<IOCAF3>
extern volatile __bit                   IOCAF3              __at(0xE3);	// @ (0x1C * 8 + 3)
#define                                 IOCAF3_bit          _BIT_ACCESS(IOCAF,3)
// IOCAN<IOCAN0>
extern volatile __bit                   IOCAN0              __at(0xD8);	// @ (0x1B * 8 + 0)
#define                                 IOCAN0_bit          _BIT_ACCESS(IOCAN,0)
// IOCAN<IOCAN1>
extern volatile __bit                   IOCAN1              __at(0xD9);	// @ (0x1B * 8 + 1)
#define                                 IOCAN1_bit          _BIT_ACCESS(IOCAN,1)
// IOCAN<IOCAN2>
extern volatile __bit                   IOCAN2              __at(0xDA);	// @ (0x1B * 8 + 2)
#define                                 IOCAN2_bit          _BIT_ACCESS(IOCAN,2)
// IOCAN<IOCAN3>
extern volatile __bit                   IOCAN3              __at(0xDB);	// @ (0x1B * 8 + 3)
#define                                 IOCAN3_bit          _BIT_ACCESS(IOCAN,3)
// IOCAP<IOCAP0>
extern volatile __bit                   IOCAP0              __at(0xD0);	// @ (0x1A * 8 + 0)
#define                                 IOCAP0_bit          _BIT_ACCESS(IOCAP,0)
// IOCAP<IOCAP1>
extern volatile __bit                   IOCAP1              __at(0xD1);	// @ (0x1A * 8 + 1)
#define                                 IOCAP1_bit          _BIT_ACCESS(IOCAP,1)
// IOCAP<IOCAP2>
extern volatile __bit                   IOCAP2              __at(0xD2);	// @ (0x1A * 8 + 2)
#define                                 IOCAP2_bit          _BIT_ACCESS(IOCAP,2)
// IOCAP<IOCAP3>
extern volatile __bit                   IOCAP3              __at(0xD3);	// @ (0x1A * 8 + 3)
#define                                 IOCAP3_bit          _BIT_ACCESS(IOCAP,3)
// INTCON<IOCIE>
extern volatile __bit                   IOCIE               __at(0x5B);	// @ (0xB * 8 + 3)
#define                                 IOCIE_bit           _BIT_ACCESS(INTCON,3)
// INTCON<IOCIF>
extern volatile __bit                   IOCIF               __at(0x58);	// @ (0xB * 8 + 0)
#define                                 IOCIF_bit           _BIT_ACCESS(INTCON,0)
// OSCCON<IRCF0>
extern volatile __bit                   IRCF0               __at(0x84);	// @ (0x10 * 8 + 4)
#define                                 IRCF0_bit           _BIT_ACCESS(OSCCON,4)
// OSCCON<IRCF1>
extern volatile __bit                   IRCF1               __at(0x85);	// @ (0x10 * 8 + 5)
#define                                 IRCF1_bit           _BIT_ACCESS(OSCCON,5)
// OSCCON<IRCF2>
extern volatile __bit                   IRCF2               __at(0x86);	// @ (0x10 * 8 + 6)
#define                                 IRCF2_bit           _BIT_ACCESS(OSCCON,6)
// STATUS<IRP>
extern volatile __bit                   IRP                 __at(0x1F);	// @ (0x3 * 8 + 7)
#define                                 IRP_bit             _BIT_ACCESS(STATUS,7)
// LATA<LATA0>
extern volatile __bit                   LATA0               __at(0x38);	// @ (0x7 * 8 + 0)
#define                                 LATA0_bit           _BIT_ACCESS(LATA,0)
// LATA<LATA1>
extern volatile __bit                   LATA1               __at(0x39);	// @ (0x7 * 8 + 1)
#define                                 LATA1_bit           _BIT_ACCESS(LATA,1)
// LATA<LATA2>
extern volatile __bit                   LATA2               __at(0x3A);	// @ (0x7 * 8 + 2)
#define                                 LATA2_bit           _BIT_ACCESS(LATA,2)
// CLC1SEL0<LC1D1S0>
extern volatile __bit                   LC1D1S0             __at(0x190);	// @ (0x32 * 8 + 0)
#define                                 LC1D1S0_bit         _BIT_ACCESS(CLC1SEL0,0)
// CLC1SEL0<LC1D1S1>
extern volatile __bit                   LC1D1S1             __at(0x191);	// @ (0x32 * 8 + 1)
#define                                 LC1D1S1_bit         _BIT_ACCESS(CLC1SEL0,1)
// CLC1SEL0<LC1D1S2>
extern volatile __bit                   LC1D1S2             __at(0x192);	// @ (0x32 * 8 + 2)
#define                                 LC1D1S2_bit         _BIT_ACCESS(CLC1SEL0,2)
// CLC1SEL0<LC1D2S0>
extern volatile __bit                   LC1D2S0             __at(0x194);	// @ (0x32 * 8 + 4)
#define                                 LC1D2S0_bit         _BIT_ACCESS(CLC1SEL0,4)
// CLC1SEL0<LC1D2S1>
extern volatile __bit                   LC1D2S1             __at(0x195);	// @ (0x32 * 8 + 5)
#define                                 LC1D2S1_bit         _BIT_ACCESS(CLC1SEL0,5)
// CLC1SEL0<LC1D2S2>
extern volatile __bit                   LC1D2S2             __at(0x196);	// @ (0x32 * 8 + 6)
#define                                 LC1D2S2_bit         _BIT_ACCESS(CLC1SEL0,6)
// CLC1SEL1<LC1D3S0>
extern volatile __bit                   LC1D3S0             __at(0x198);	// @ (0x33 * 8 + 0)
#define                                 LC1D3S0_bit         _BIT_ACCESS(CLC1SEL1,0)
// CLC1SEL1<LC1D3S1>
extern volatile __bit                   LC1D3S1             __at(0x199);	// @ (0x33 * 8 + 1)
#define                                 LC1D3S1_bit         _BIT_ACCESS(CLC1SEL1,1)
// CLC1SEL1<LC1D3S2>
extern volatile __bit                   LC1D3S2             __at(0x19A);	// @ (0x33 * 8 + 2)
#define                                 LC1D3S2_bit         _BIT_ACCESS(CLC1SEL1,2)
// CLC1SEL1<LC1D4S0>
extern volatile __bit                   LC1D4S0             __at(0x19C);	// @ (0x33 * 8 + 4)
#define                                 LC1D4S0_bit         _BIT_ACCESS(CLC1SEL1,4)
// CLC1SEL1<LC1D4S1>
